doc-final-thesis/projekt.org
* (front matter)                                              :ignoreheading:
#+OPTIONS: texht:nil toc:nil author:nil
#+LATEX_CLASS: fitthesis
#+LATEX_CLASS_OPTIONS: [english,odsaz]
#+BIND: org-latex-title-command ""
# zadani = includes zadani.pdf
# print = B&W links and logo
# cprint = B&W links, color logo
# %\graphicspath{{obrazky-figures/}{./obrazky-figures/}}
#+LaTeX_HEADER: \input{metadata}
#+LATEX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usepackage[figure,table]{totalcount}
#+BEGIN_LaTeX
\maketitle
\setlength{\parskip}{0pt}
{\hypersetup{hidelinks}\tableofcontents}
\iftotalfigures\listoffigures\fi
\iftotaltables\listoftables\fi
\iftwoside\cleardoublepage\fi
\setlength{\parskip}{0.5\bigskipamount}
#+END_LaTeX

* Introduction
- a concrete motivating example of a Haskell app that needs a web client, plus
  why to write a PWA
- general trends in Haskell and frontend development
- related work (Tweag, Obsidian, ...)

* Technologies
We'll first have a more detailed look at the above-mentioned technologies, [...]

** Haskell
The programming language Haskell is a rather old one, despite spreading into the
industry only recently, having been around since 1990 [TODO: reference]. It is a
language that started out as a basis for research into the design of functional
languages. It has served as such, and in fact it still is the target of active
research - some more prominent projects are "Dependent Haskell" [TODO: ref] and
"Linear Haskell" [TODO: ref].

Haskell is described as a "statically typed, purely functional programming
language with type inference and lazy evaluation" [TODO: ref]. It is a language
in which its expressive type system enables very precise control over TODO:
expressive types, dialog with the compiler, types encoding effects, citation for
"If it compiles, it works".

TODO: language to write reliable software in - it eliminates entire classes of
programming errors - usually the ones that remain are logic errors.

While Haskell is not a language commonly associated with frontend development,
it is one of the many languages with the ability to use JavaScript as the
compilation target, instead of plain assembly or LLVM. In fact, such languages
have now become quite common in frontend development [TODO: ref], as is
exemplified by the rapid rise of TypeScript, a superset of ECMAScript 6 [TODO:
ref], or Elm, a framework with its own language based on Haskell [TODO: ref].

Of the many reasons for selecting a language other than JavaScript for frontend
development, one of the more notable ones is the ability to share code between
the server and its client in the case they are written in the same
language. This is the basic idea of the framework Meteor [TODO: ref], and in
fact the ability to run 'isomorphic code' - the same code on the client and the
server both - is its main marketing point.

TODO: Haskell on the frontend is a rapidly growing area with many interested
companies. The main projects in this area are sponsored and developed by them -
some of the main contributors are: Obsidian (Reflex, Obelisk), Tweag (Asterius,
Inline-js), and QFPL (several UI components). [TODO: refs] While it's a quickly
growing area, it's still not an established one, and there are many libraries
and tools still missing, ones that developers used to other languages have
learned to expect and require.

#+BEGIN_SRC haskell :exports code
  type HackageAPI =
    "users" :> Get '[JSON] [User] :<|>
    "user" :> Capture "login" Login :> Get '[JSON] User :<|>
    "packages" :> Get '[JSON] [Package]

  getUsers :: Handler [User]
  getUser :: Login -> Handler User
  getPackages :: Handler [Package]

  server :: Server HackageApi
  server = getUsers :<|> getUser :<|> getPackages

  getUsers :<|> getUser :<|> getPackages =
    client @HackageApi "http://hackage.haskell.org"
#+END_SRC

** Nix
- /"Nix package manager, a "purely functional" package and configuration
  manager for computer systems"/ -- Wikipedia
- /"Describe your end result, then magic happens"/
- Tools build on top:
  - Nix = package manager
  - NixOS = operating system
  - NixOps = cloud deployment tool
- cross-compiling

- since 2004, Eelco Dolstra's Ph.D. thesis in 2006
- purely functional, lazy evaluation
- one program consists of a closure that includes all dependencies including libc
- atomic upgrades, rollbacks
- complete isolation of dependencies, no DLL hell
- NixOS = OS built on top of Nix
- NixOps = a cloud deployment tool
  - conceptually: Terraform/CloudFormation + Puppet/Ansible
  - a network specification -> magic -> running set of servers on AWS, VPSs,
    VirtualBox, ...

#+BEGIN_SRC nix :exports code
  {
    network.description = "Web server";

    webserver = { config, pkgs, ... }: {
      services.httpd.enable = true;
      services.httpd.adminAddr = "alice@example.org";
      services.httpd.documentRoot =
        "${pkgs.valgrind.doc}/share/doc/valgrind/html";
      networking.firewall.allowedTCPPorts = [ 80 ];

      deployment.targetEnv = "virtualbox";
    };
  }
#+END_SRC

** PWA
- concrete examples of existing apps
- general reasons for PWA development
- Web Platform APIs, Service Workers

* Research
In order to write a SPA/PWA, there are some tools and supporting libraries that
a developer can't live without. We'll first walk through a high-level overview
of the common features of the Web frameworks of today, then go through the most
popular frameworks and see where they shine. Afterwards, we'll have a look at
the ecosystem of Haskell and try to find its strong and weak points, and
especially the places where the tools or libraries are entirely missing.

** Common features of Web frameworks
-- A description of the things I'll be looking for, partially from
Wikipedia's [[https://en.wikipedia.org/wiki/Comparison_of_web_frameworks][Comparison of web frameworks]] and [[https://en.wikipedia.org/wiki/Comparison_of_JavaScript_frameworks][Comparison of JavaScript
frameworks]], partially from my own experience, and partially from the feature
lists of the frameworks that I'll be looking into.

