doc-final-thesis/projekt.tex
% Created 2019-02-01 Fri 16:13
% Intended LaTeX compiler: pdflatex
\documentclass[english,odsaz]{fitthesis}
\renewcommand\title[1]{}
\input{metadata}
\usepackage{minted}
\usepackage[figure,table]{totalcount}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

% * (front matter)                                              :ignoreheading:
\maketitle
\setlength{\parskip}{0pt}
\{\hypersetup{hidelinks}\tableofcontents\}
\iftotalfigures\listoffigures\fi
\iftotaltables\listoftables\fi
\iftwoside\cleardoublepage\fi
\setlength{\parskip}{0.5\bigskipamount}

\chapter{Introduction}
\label{sec:orgb206161}
\begin{itemize}
\item a concrete motivating example of a Haskell app that needs a web client, plus
why to write a PWA
\item general trends in Haskell and frontend development
\item related work (Tweag, Obsidian, \ldots{})
\end{itemize}

\chapter{Technologies}
\label{sec:orgc801d41}
We'll first have a more detailed look at the above-mentioned technologies, [\ldots{}]

\section{Haskell}
\label{sec:org750025f}
The programming language Haskell is a rather old one, despite spreading into the
industry only recently, having been around since 1990 [TODO: reference]. It is a
language that started out as a basis for research into the design of functional
languages. It has served as such, and in fact it still is the target of active
research - some more prominent projects are "Dependent Haskell" [TODO: ref] and
"Linear Haskell" [TODO: ref].

Haskell is described as a "statically typed, purely functional programming
language with type inference and lazy evaluation" [TODO: ref]. It is a language
in which its expressive type system enables very precise control over TODO:
expressive types, dialog with the compiler, types encoding effects, citation for
"If it compiles, it works".

TODO: language to write reliable software in - it eliminates entire classes of
programming errors - usually the ones that remain are logic errors.

While Haskell is not a language commonly associated with frontend development,
it is one of the many languages with the ability to use JavaScript as the
compilation target, instead of plain assembly or LLVM. In fact, such languages
have now become quite common in frontend development [TODO: ref], as is
exemplified by the rapid rise of TypeScript, a superset of ECMAScript 6 [TODO:
ref], or Elm, a framework with its own language based on Haskell [TODO: ref].

Of the many reasons for selecting a language other than JavaScript for frontend
development, one of the more notable ones is the ability to share code between
the server and its client in the case they are written in the same
language. This is the basic idea of the framework Meteor [TODO: ref], and in
fact the ability to run 'isomorphic code' - the same code on the client and the
server both - is its main marketing point.

TODO: Haskell on the frontend is a rapidly growing area with many interested
companies. The main projects in this area are sponsored and developed by them -
some of the main contributors are: Obsidian (Reflex, Obelisk), Tweag (Asterius,
Inline-js), and QFPL (several UI components). [TODO: refs] While it's a quickly
growing area, it's still not an established one, and there are many libraries
and tools still missing, ones that developers used to other languages have
learned to expect and require.

\begin{minted}[]{haskell}
type HackageAPI =
  "users" :> Get '[JSON] [User] :<|>
  "user" :> Capture "login" Login :> Get '[JSON] User :<|>
  "packages" :> Get '[JSON] [Package]

getUsers :: Handler [User]
getUser :: Login -> Handler User
getPackages :: Handler [Package]

server :: Server HackageApi
server = getUsers :<|> getUser :<|> getPackages

getUsers :<|> getUser :<|> getPackages =
  client @HackageApi "http://hackage.haskell.org"
\end{minted}

\section{Nix}
\label{sec:org6d3bbd4}
\begin{itemize}
\item \emph{"Nix package manager, a "purely functional" package and configuration
manager for computer systems"} -- Wikipedia
\item \emph{"Describe your end result, then magic happens"}
\item Tools build on top:
\begin{itemize}
\item Nix = package manager
\item NixOS = operating system
\item NixOps = cloud deployment tool
\end{itemize}
\item cross-compiling

\item since 2004, Eelco Dolstra's Ph.D. thesis in 2006
\item purely functional, lazy evaluation
\item one program consists of a closure that includes all dependencies including libc
\item atomic upgrades, rollbacks
\item complete isolation of dependencies, no DLL hell
\item NixOS = OS built on top of Nix
\item NixOps = a cloud deployment tool
\begin{itemize}
\item conceptually: Terraform/CloudFormation + Puppet/Ansible
\item a network specification -> magic -> running set of servers on AWS, VPSs,
VirtualBox, \ldots{}
\end{itemize}
\end{itemize}

\begin{minted}[]{nix}
{
  network.description = "Web server";

  webserver = { config, pkgs, ... }: {
    services.httpd.enable = true;
    services.httpd.adminAddr = "alice@example.org";
    services.httpd.documentRoot =
      "${pkgs.valgrind.doc}/share/doc/valgrind/html";
    networking.firewall.allowedTCPPorts = [ 80 ];

    deployment.targetEnv = "virtualbox";
  };
}
\end{minted}

\section{PWA}
\label{sec:org08c60c8}
\begin{itemize}
\item concrete examples of existing apps
\item general reasons for PWA development
\item Web Platform APIs, Service Workers
\end{itemize}

\chapter{Research}
\label{sec:org711ec91}
In order to write a SPA/PWA, there are some tools and supporting libraries that
a developer can't live without. We'll first walk through a high-level overview
of the common features of the Web frameworks of today, then go through the most
popular frameworks and see where they shine. Afterwards, we'll have a look at
the ecosystem of Haskell and try to find its strong and weak points, and
especially the places where the tools or libraries are entirely missing.

\section{Common features of Web frameworks}
\label{sec:org5b63cff}
-- A description of the things I'll be looking for, partially from
Wikipedia's \href{https://en.wikipedia.org/wiki/Comparison\_of\_web\_frameworks}{Comparison of web frameworks} and \href{https://en.wikipedia.org/wiki/Comparison\_of\_JavaScript\_frameworks}{Comparison of JavaScript
frameworks}, partially from my own experience, and partially from the feature
lists of the frameworks that I'll be looking into.
