doc-final-thesis/projekt.org
*** Tooling
I'll start with the things you encounter first when setting up a project, its
tools. Developers have wildly differing levels of expectations from their tools. A
Python developer might expect just a text editor and an interpreter, whereas a
JVM developer might not be satisfied with anything less than a full-featured IDE.

*Code generators* or scaffolding tools start with creating a package manifest and
a ~src/~ directory, going on to generators that set up a few different types of
projects based on templates, all the way to tools that can add an entire website
module, perhaps even with database migrations.

*Build tools* range from a set of conventions on how to use your build tool that
might get formalized in your Makefile, through a CLI tool that takes care of
building, testing and perhaps even deploying your project, to the way of the IDE
where anything you can think of is just a few clicks away.

*Debugging tools* also come in many flavors and for many purposes. On the side of
the server, you have all the usual tools for the language, plus a few more - a
toolbar with an overview of everything that goes on in a page render or an AJAX
call, or the option to remotely connect to a running process and to debug
live. Client-side, we have the now irreplaceable DevTools with a built-in
debugger and profiler, but some frameworks go even further and provide a
framework-specific tools - React's component tree, or Elm's time-traveling
debugger.

*Quality assurance tools* have many sub-categories. From static code analysis
tools or linters, as they are commonly known; through tests - unit, integration,
end-to-end tests, or more exotic ones like marble tests or visual regression
tests; to profilers - runtime or allocation measurements, frontend performance
measurements, or more involved tools like performance evolution tracking.

*** Features
TODO: Reread and clean up

*Templating*, which at the frontend means a way to compose the HTML that makes up
an application, usually including some render logic and variable
interpolation. In some frameworks the whole program is a template (see React),
some have templates in separate files and pre-compile them during runtime (see
Angular). Templates sometimes contain CSS as well (see the new CSS-in-JS trend)

*Forms* are the basic element of interactive applications. There are a few layers
of abstraction at which a framework can decide to implement forms - starting at
raw DOM manipulation, going on to data containers with validation (but manual
rendering), all the way up to form builders, manual or automatic. Under 'forms'
I count a way to render a form, to validate user input, and collect the result.

*Routing* means manipulating the displayed URL using the History API and changing
the application state to reflect it, and also loading the correct state on
application start-up. This can also include animated transitions between pages.

*Internationalization* has many levels. At its most basic, it means simple string
translations, pluralization, and word order. Going further, it means also RTL
scripts, date/time formats, currency, or time zones.

Modern web frameworks also provide a way to use a web application's code and
compile it into a *native mobile application*. It's commonly implemented as a
wrapper application around web apps using Cordova, but technologies like React
Native go further and use native UI elements. Mobile applications can be faster
to use and faster to load, can access device-specific APIs not exposed via Web
Platform APIs.

Some frameworks also support creating a *desktop application* that reuses a web
application's code. The underlying technology here is Electron and not Cordova,
but the benefits are the same - greater speed and access to device-specific
functionality.

*** Accessibility (ARIA, ...)
- the key word now is ARIA = support for screen readers
- also, semantic elements, text contrast, customization
- also also, keyboard-accessibility (shortcuts, every clickable element
  accessible via keyboard = tabindex)
- accessibility testing (automatic as well, see aXe)

*** Optimistic updates
- one of the things I want to focus on
- broadly, expecting that every network request will be successful and updating
  the GUI accordingly
- rolling back app state in case of failure, with notifications

*** Web Platform
- location, camera, touch, vibration, ...

*** Pre-render
- one approach to shortening start-up times
- serving HTML with all the content already inside, no need for more requests to
  the backend for the initial page load
- JS takes over and uses what's already been loaded
- can be static or dynamic:
  - static = JAM stack, serving a bunch of files rendered at compile-time
  - dynamic = rendering the HTML at runtime

TODO: What about the backend feature write-ups I have?

** JavaScript ecosystem
*** Angular
TODO: what is it?
On a first look, Angular looks like a well thought-out frontend
framework. Written in Typescript with comprehensive documentation and great
tooling, it seems that the authors have learned from their mistakes with
AngularJS.

Some notable features:
- command line tool, ~ng~ - it streamlines setting up the entire project -
  scaffolding, preparing build and testing tools, starting a
  development server, ...
- runtime environments - from server-side rendering, PWAs with ServiceWorkers,
  to native and desktop applications, it seems that Angular tries to cover every
  possible use-case
- tooling other than the ~ng~ tool - browser extensions for runtime debugging,
  IDEs and others. I haven't thought of a tool I would miss, but I'm used to
  minimalism in tooling from the Haskell world...

Some negatives that developers complain about:
- Angular is intimidating for a new developer, it's too complex and there's a
  lot to learn
- Too much 'magic' - related to the previous point, there's a lot of abstraction
  and it's not easy to understand all the layers
- Code bloat - the amount of boilerplate and also the size of the resulting bundle
- Too opinionated - if you don't like 'the angular way', you're out of luck here
- scattered documentation - too many articles and tutorials out there for
  AngularJS that can't work with the new Angular

