doc-final-thesis/projekt.org
*** React
React is not a framework in itself. Rather, it's a library that focuses on a
single thing and does it in a unique enough way that there's sprung up an entire
ecosystem around it. In it, there are groups of libraries that build upon React,
each focusing on a single feature - UI components, state management, forms etc.

There's a large jungle of libraries, each one with a different scope and
focus. Choosing a library that fits your problem can sometimes take many
attempts. Add to it the fact that libraries, frameworks and tools come and go
quite quickly - the main cause of the so-called "JavaScript fatigue - and the
fact that in JavaScript, it's fashionable to write extremely small libraries,
and you have a recipe for a quite unpleasant development experience.

I'll try to go through some of the most popular 'frameworks' that build on
React, though each one is more of a pre-built toolkit of libraries and tools
and bits of glue in between, rather than cohesive frameworks. In general, the
React world is a lot more mix-and-match than developers used to enterprise
frameworks would expect.

Create-react-app, nwb, Razzle, and Neutrino all cover only the build
process. Next.js is the first one that I've found that goes a step beyond just
pre-configuring Webpack and other build tools - it provides other features that
are starting become standard - server-side runtime rendering, link prefetching,
and build-time prerendering. It's also the first tool I found that considers
that a website can consist of multiple applications, via its 'zones' feature.

TODO: developers' opinions

*** Gatsby
One rather unique framework I found - and this is a framework in a strong
sense, not like the React tools above - is Gatsby. It's unique in the sense that
while it's a frontend framework, it's not supposed to run in a browser. It's a
part of a growing movement centered around the 'JAM stack' - "JavaScript, APIs,
and Markup". That doesn't tell you much, but the main feature is that at
build-time, you fetch data from your APIs, and render the application to plain
HTML files, so that you don't need a server other than an S3 bucket or similar.

It's a framework targeted at a specific subset of website - not single-page
applications, but more blogs or e-shops, and a workflow exemplified by Netlify.
This means it doesn't need to concern itself with many features that would be
missing in a frontend framework intended for a browser, and those are delegated
to a different part of the stack.

TODO: opinions, structured pro/cons

*** Vue.js
TODO: Vue.js

*** Polymer
TODO: Polymer

** PHP ecosystem
TODO: PHP ecosystem

** Haskell ecosystem
TODO: Compare Haskell compared to the above list

- its strong points
- passable but not ideal libraries
- what's missing

*** UI toolkit
At the frontend, the UI toolkit defines what the entire application will look
like, its architecture as well as the tools it can use. There is significant
pressure on well-defined types in Haskell, and the UI libraries have pushed
strongly in favor of FRP (Functional Reactive Programming) or its derivatives
(see 'Elm architecture' [TODO: ref]).

I've managed to find five production-ready libraries that are usable with
GHCJS. Out of these five, ~react-flux~ and ~transient~ are unmaintained, and ~reflex~,
~miso~, and ~concur~ all wildly differ in their philosophy, architecture, and
maturity.

~Reflex~ ([TODO: ref] and ~reflex-dom~ [TODO: ref], its DOM bindings) seems like the
most actively maintained one, and also the most promising one regarding its
future outlooks - it's sponsored by Obsidian Systems [TODO: ref, again] and
actively developed for general use on GitHub. [TODO: describe its FRP, ...]

~Miso~ [TODO: ref] - TODO: Elm architecture re-implementation in Haskell

~Concur~ [TODO: ref] - TODO: an experimental architecture but actively developed,
variants in PureScript as well. A technology to investigate in the future, but
no ecosystem right now and not fully mature.

TODO: examples of Reflex, Miso, Concur

*** Build tools
The UI toolkit constrains the choice of possible build tools. In Haskell, there
are three mature options - Cabal (new-build) [TODO: ref], Stack, and Nix. There
is also a new fourth option aiming for the best of these four, Snack [TODO:
ref]. While it's not yet mature enough for serious use, it's a tool worth future
investigation.

Cabal - old, Cabal hell. Stack came, divided the Haskell community. Nix came out
of nowhere, converted a significant portion but isn't yet dominant, and now
cabal new-build is almost equivalent to stack. Free choice between cabal and
stack, nix is more capable in general but slower learning curve. TODO: more
about snack

GHCJS ecosystem not so well supported with Cabal (old or new one), Nix is
usually recommended at the frontend (one command setup, binary cache,
cross-platform), Reflex especially - uses the great Nix cross-compilation
capabilities for Android, iOS, desktop. Stack usable for plain GHCJS dev, but
old GHC (7.10?).

Slow compiler - common workaround is to use the REPL, but there are other
solutions like Snack which are promising although not widely used.

GHCJS output size and speed - GHCJS should be obsoleted by WebAssembly very
soon - it's already in alpha state, and I expect it will be ready for
production by the end of 2019.

Lack of editor integration - solved with LSP+HIE (usable in VSCode and other modern
editors), but Emacs is still the safest choice. Hlint (linter), Hindent
(formatter) built into HIE and Intero both, same goes for 'go-to-definition' and
'type-at-point' features common to modern IDEs. What's missing is debugger
integration - usually via GHCi only, but projects like haskell-dap (+ Phoityne
editor plugin) exist.

*** UI components
Preferred approach - implement UI and logic inside application code. FFI is
usable and quite simple for bigger components (see reflex-dom-ace).

Reflex and Concur - self-contained components and global state both (-> reusability)
Miso - single state atom only (see TEA)

*** Forms
No good options exist for any of the frameworks. While there are some attempts
at a forms library for Reflex, there is not a single feature-complete
library. Part of the reason - validation-only libraries exist in Haskell and
commonly used (see ~validation~, ~digestive-functors~). There are forms libraries at
the backend (see ~yesod-form~) with almost automatic form generation.

*** Routing
Miso has routing built-in. There are several attempts at a Reflex routing
library but not a single accepted solution. Concur with its small ecosystem
doesn't have even that.

*** Mobile/desktop apps
Reflex has this built-in via reflex-platform. Obelisk, building on top of
reflex-platform, includes bundling apps for App/Play Store. Cross-compilation via
Nix to Android/iOS, reflex-dom's bindings to WkWebView on desktop. I haven't
found any attempt to do this for Miso or Concur (Concur has beginnings of React
Native and SDL backends, but the development seems to have stalled).

*** Accessibility
I haven't found anything related to this topic, so I must assume no one has even
attempted to tackle this topic. Building accessible applications by yourself
isn't hard though.

*** Optimistic updates
I haven't found anything related to this topic. For FRP though, this should be
implemented at the data or network layers though, so this is something to work
towards when building the 'offline storage' library as per my assignment.

