doc-final-thesis/projekt.tex

\subsection{Web Plaftorm}
\label{sec:org472434a}
The library JSaddle wraps the entirety of the Web Platform APIs using
WebIDL. Any UI library can use this library, though there are limited
event-based bindings, which means writing manual wrappers. (Reflex has some
machinery for a subset for it, Miso has subscriptions for some of them, Concur
uses ghcjs-vdom which has also some limited bindings.)

\subsection{Prerender (Isomorphic rendering)}
\label{sec:org9bd88aa}
Reflex has explicit support, \texttt{preRender} allows even for two variants of an
element if it doesn't render well. Miso has explicit support as well. I haven't
found anything like this for Concur.

\subsection{Support tools}
\label{sec:orgac67c30}
Linter - Haskell standard is Hlint, support for custom rules, well-supported and
mature. Code formatter situation is more divided, Hindent follows gofmt with a
single code style for all code (but doesn't cover edge cases esp. for type-heavy
code, so not ideal). Brittany is an ambitious project using GHC's parser itself,
nicely designed formatting rules, but supports only a limited subset of the
language. Several other projects, some unmaintained, some brand new, but Hindent
seems to be standard at the moment.

The situation around code generators isn't ideal. Stack bundles several
templates, but is limited to Stack users. Cabal has a single template, nothing
else. Nix doesn't care about scaffolding. Several other tools, mostly
unmaintained - Summoner is a notable one, with a fixed project structure; Hi is
another one, supports arbitrary templates. There is no standard tool, usually
only 'git clone' a project template and start developing. Obelisk has a standard
structure, but it's a very limiting one (Snap as the only server library,
predetermined routing library obelisk-route, \ldots{}).

TODO: more code generation tooling - 'rails new
controller/scaffold/module/model/migration'

\subsection{Quality Assurance}
\label{sec:orgf74ee0c}
On this front, Haskell is very developed, at least theoretically. QuickCheck
originated in Haskell and quickly propagated to many other languages - followup
tools like SmallCheck and similar. That's generative, or property-based testing,
best in class.

Classical unit and integration testing has also many options - hspec, hedgehog,
tasty, doctest, \ldots{} Mocking via free monads or other MonadX
implementations. TODO

End-to-end testing - Selenium webdriver wrappers exist, and Selenium is the
standard for testing servers and clients. (Or alternately shelltestrunner for
testing CLI based applications.)

Benchmarking - best in class - criterion, no competition. Weigh - allocation
measurements as a benchmark.

\subsection{Documentation}
\label{sec:org6c008b1}
It is generally agreed that documentation is Haskell's weakest point. Despite
having a great standard API docs tool (haddock), documentation is often an
afterthought, with incomplete docs or unclear starting points (which means no
tutorials etc. either).

\subsection{Server-side tools}
\label{sec:org8ab9455}
\begin{itemize}
\item Communication - typed APIs (HTTP - servant, WebSocket - some attempts, nothing
production-ready)
\item Entities - many options, some great, some less
\item Migrations - weak point, I've found many half-baked implementations, but no
standard solution (not only a Haskell problem, Liquibase is the only standard
here, and that's SQL only)
\end{itemize}

\section{Implementation plan}
\label{sec:orgdb7a8d2}
TODO: Somehow use the "Evolving frameworks" article

In this thesis, I'll focus mainly on the tools that are necessary specifically
for PWA development, not general quality-of-life libraries.

\textbf{Goal = app that fulfills the basic PWA criteria}:
\begin{itemize}
\item Pages are responsive on tablets \& mobile devices
\item All app URLs load while offline
\item Metadata provided for Add to Home screen
\item Page transitions don't feel like they block on the network
\item Each page has a URL
\item Pages use the History API
\item Site uses cache-first networking
\item Site appropriately informs the user when they're offline
\item Push notifications (consists of several related requirements)
\end{itemize}

To achieve this, I need to create:
\begin{itemize}
\item A full-featured browser routing library. While there are some existing
implementations, they are either incomplete or long abandoned.
\item A wrapper around ServiceWorkers, or a template to simplify project creation.
\item A push notifications library.
\item A library or a script that will render HTML 'shells' of all pages on the site,
for fast first load.
\item CLI tool (requirement from assignment? "support tools")
\item An offline storage library (some variant of it)
\end{itemize}

Not required by the checklist, but would improve the quality of my work:
\begin{itemize}
\item A template of an application, with predefined internal architecture, that uses
all of the above libraries
\item A utility library for querying and caching data from an API, be it HTTP, WebSocket,
GraphQL, or others.
\end{itemize}

\textbf{Stretch goals}:
\begin{itemize}
\item a library to use in code shared between the server and client - a way to
define the shape of the transport channel (and its API for non-Haskell
applications)
\item a server library, to allow user code to implement the specified protocol
\item a client library with a storage component for entities and pending requests
\end{itemize}

TODO: talk about how these tools will fit into a 'platform', so that I check of
a box from the assignment

An application using these tools and libraries would consist of a server written
independently, and of a browser application. Implementing the communication
between them is left to the developer, as is implementing many common
conveniences usually provided by a framework.

\textbf{Stretch}: An application using these libraries would consist of a server and a client
sharing code that contains the definition of their communication channel. I do
not yet know how much these libraries would affect the shape/architecture of the
server, but the client library would form the core of the client - with the
libraries from the previous plan forming the shell.

These goals also include fully documenting the code written, as well as testing
and benchmarking it to remove the most obvious bottlenecks.

TODO: talk about Serverless, JAM stack, and alternative app structures:
\begin{itemize}
\item Client only. An application that doesn't need to communicate with a server,
like a web presentation, or a blog, a set of pre-compiled HTML+JS files.
\item Server only. Either just an API, or a plain HTML website with no JavaScript.
\item Server and client, with the client rendered during run-time by the server.
\item Server and client, with the client rendered during build-time and served
separately (e.g. via an S3 bucket).
\item Server and client, with the client re-rendered on demand, whenever the data that
it shows changes. This is the shape of a 'JAM stack' application.
\item Projects with multiple clients and/or servers (even more pressure on
supporting tools)
\end{itemize}

\chapter{Components}
\label{sec:orgc382420}
TODO: Demonstrate the principles of components on 'src-snippets' code, where
I'll show the smallest possible code that implements that functionality

\section{Component A}
\label{sec:org073fa74}
\subsection{Design}
\label{sec:org387b696}
\subsection{Implementation}
\label{sec:org2313038}
\subsection{Testing}
\label{sec:orgd6a30e6}
\subsection{Other options, possible improvements}
\label{sec:org100d9bd}

\chapter{Applications}
\label{sec:org2d042a0}
\section{Workflow and tools}
\label{sec:org333237e}
TODO: describe the development flow of an app built using these tools

\begin{itemize}
\item starting out - three layer cake \& esp. the inner one
\item QA (tests, e2e, CI, \ldots{}), documentation
\item development tool options
\item deployment options
\end{itemize}
