doc-final-thesis/projekt.tex

\section{TodoMVC}
\label{sec:org1e4d0b5}

\section{RealWorld}
\label{sec:org040d0fb}

\chapter{Conclusion}
\label{sec:org3589e86}
TODO: return to the comparison with JS, PHP, \ldots{} frameworks

TODO: describe possible follow-up work, what I'll be working on - define
  specific topics and make concrete examples

The final chapter includes an evaluation of the achieved results with a special
emphasis on the student's own contribution. A compulsory assessment of the
project's development will also be required, the student will present ideas
based on the experience with the project and will also show the connections to
the just completed projects. \cite{Pravidla}

% * (bibliography, start of appendix)                           :ignoreheading:
\makeatletter
\def\@openbib@code{\addcontentsline{toc}{chapter}{Bibliography}}
\makeatother
\bibliographystyle{bib-styles/englishiso}

\begin{flushleft}
\bibliography{projekt}
\end{flushleft}
\iftwoside\cleardoublepage\fi

% Appendices
\appendix
\appendixpage
\iftwoside\cleardoublepage\fi

\startcontents[chapters]
% \setlength{\parskip}{0pt}
% \printcontents[chapters]{l}{0}\{\setcounter{tocdepth}{2}\}
% \setlength{\parskip}{0.5\bigskipamount}
\iftwoside\cleardoublepage\fi

\chapter{Contents of the attached data storage}
\label{sec:orge8b856d}
TODO: fill in

\chapter{Poster}
\label{sec:org13d39f2}
TODO: fill in
\end{document}